Revit 2024 API
SweptBlend.BottomSketch Property
The bottom profile sketch of the swept blend.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Sketch BottomSketch { get; }
Visual Basic
Public ReadOnly Property BottomSketch As Sketch
	Get
Visual C++
public:
property Sketch^ BottomSketch {
	Sketch^ get ();
}
Remarks
If the bottom profile is based on a family symbol, this property is null.
See Also
SweptBlend Class
Autodesk.Revit.DB Namespace